---
kind: enumMember
id: F:Autodesk.Revit.DB.TemporaryViewMode.RevealHiddenElements
enum: Autodesk.Revit.DB.TemporaryViewMode
source: html/8c0c72db-2801-3642-72bb-108cfdff23e1.htm
---
# Autodesk.Revit.DB.TemporaryViewMode.RevealHiddenElements

The view is in reveal hidden elements mode